{
    "Ace": "is used to describe something that is awesome. A word that is popular in the north and amongst youngsters.",
    "Any road": "when you hear this, the person isnt asking you to pick a road! They are most likely substituting it for anyway and the context could be any road are you from China or Japan.",
    "A load of tosh": "is used to describe something that is not very good. For example, your lecturer might describe your essay as a load of tosh . harsh!",
    "A Kent face": "commonly used in Scotland when a person has seen a person they know, such as I saw a few Kent faces in the library. This idiom has nothing to do with the surname or the place. It is taken from an old English word that means to know.",
    "Adam and Eve": "Cockney rhyming slang for believe. Can you Adam and Eve it!",
    "Bees knees": "the phrase does not relate to bees or knees but is an idiom for excellent. It became popular in the 1920s along with cats whiskers.",
    "Bite your arm off": "dont be alarmed if someone says this. No one is about to literally bite off any part of your anatomy. It is used to describe willingness. For example someone might say to you they will bite your arm off if you offer to write their essay.",
    "Brassed off": "considering the Brits are good at hiding their emotions we still have plenty of words to describe when we are not happy with something. One of which is brassed off.",
    "Bits n Bobs": "is used these days when you want to say you have an odd selection of things for example you could say I have a few bitsn bobs in the fridge. Ill see what I can make. However, it was originally used to describe loose change in your pocket.",
    "Bobs your uncle": "the origins of this saying and how it is used today differ. The saying originally meant you could get anything or do anything if you had the right connections because it came about after the 20th British Prime Minister, Lord Salisbury, famously appointed a nephew into an important political post for which he didnt have the relevant experience. Today it is more commonly used to say everything is OK.",
    "Butchers hook": "originates from the East End of London and is a rhyme slang for take a look.",
    "Cheerio": "No it is not just a breakfast cereal but also one of the many words used to say goodbye in the UK. Ta ta is popular in the North of England and you will also hear laters and see ya.",
    "Cheesed off": "is a quirky euphemism for being unhappy. Obviously, you would be unhappy if your cheese went off! It can be used in casual and formal situations for example someone could say Im cheesed off that you ate the last piece of cake.",
    "Chin wag": "means to have a long chat and its origins come from a Welsh word meaning empty. It is believed that the word originates from a pub in North Wales where the landlady would ensure people drunk more than they intended by going around with a jug of ale and toping peoples glasses up by saying chin wag  which is Welsh for your cup is empty.",
    "Dont teach your grandmother to suck eggs": "you may hear someone more senior in years saying this to a younger person when they feel the youngster is being disrespectful by thinking they can teach the older person something.",
    "Dishy": "is used to describe someone who is attractive.",
    "Dont cry over spilt milk": "someone may say this if you get something wrong or actually spill or break something. The essence of the saying is that you shouldnt worry about it.",
    "Daft cow": "is used amongst friends and is an affectionate way of making fun of a female friend when they have done or said something silly. Be aware the meaning changes dramatically when you say this to a stranger!",
    "Donkeys years": "Apparently donkeys live for a long time so when someone says I havent seen you for donkeys they are saying they havent seen you in a long time.",
    "Dive": "is used to describe a place that isnt very nice. Someone may say to you Its a dive but the drinks are cheap",
    "Easy peasy": "A fun and childish way of expressing something is easy to do or understand. We dare you to use it next time your lecturer is explaining something.",
    "Effing and blinding": "this expression is used to describe someone who is using unpleasant language. For example, you might hear She was so angry that she was effing and blinding all the way home!",
    "Eejit": "an Irish-based pronunciation of the word Idiot.",
    "Elevenses": "a mid-morning snack before lunch that normally includes a cup of tea and a biscuit.",
    "Earful": "is an expression used to describe someone who is being told off. For example, you may hear someone say They got an earful for being so loud last night.",
    "Full of beans": "full of beans means someone is very energetic and vivacious.",
    "For crying out loud": "This is a replacement for a rude word. For example, you discover your bike has a flat tyre & you yell Oh, for crying out loud!",
    "Faff around": "If youre faffing around you look busy, but youre achieving very little. For example: I told him to stop faffing around and wash the dishes.",
    "Flogging a dead horse": "to try and find a solution to a problem that is unsolvable. For example: Youre flogging a dead horse by asking Martha to move to the UK  she hates rain",
    "Going to a do": "student life wouldnt be student life without a fair dose of parties and if someone invites you to a do say yes because they are inviting you to a party!",
    "Gobsmacked": "if you are gobsmacked you are amazed by something or someone. In a good or bad way!",
    "Grub": "is slang for food and comes from the old English word meaning dig. The association with digging for food morphed into the slang we use today.",
    "Gobby": "is used to describe someone who talks a lot and has a lot of opinions, and not necessarily in a good way.",
    "Hammered": "is the slang word used to describe someone who is very drunk. You can say someone is tipsy if they appear to be a bit drunk.",
    "Horses for courses": "this is a popular saying that means that we all have different tastes and what is right for one person isnt necessarily right for another person.",
    "Hunky-dory": "is just a cool way of saying that something is just fine!",
    "Ive come over all peculiar": "is a peculiar saying used to describe someone who becomes unwell very quickly.",
    "Im not being funny but I havent got all day": "this is a popular saying in Wales and simply means hurry up!",
    "Im easy": "next time you are in a restaurant and your friends are debating what to order just say order whatever. Im easy. Thats a signal that youre happy with whatever they order.",
    "Im off to Bedfordshire": "is rhyming English slang for when someone is tired and wants to go to bed. Get it?",
    "Its brass monkeys outside": "is used when it is bitterly cold. The origins of this saying refer to the brass handles on doors which get very cold. This bit makes sense but the monkeys bit of this saying is baffling, even to the Brits.",
    "Jammy": "if you are a lucky person you might be described as flukey or jammy.",
    "Jim jams": "is slang for pyjamas and as a student youll hear I think its time to put on my jim jams and get into bed  Im exhausted!  a lot!",
    "Jar": "is slang for a pint of beer. For example: Lets meet after the lecture for a few jars.",
    "Jiffy": "this is a quintessentially British saying meaning youll do something immediately. You might say it to show you are keen, for example: If youre cooking dinner Ill be there in a jiffy.",
    "Knees up": "if someone says they went to a right knees-up over the weekend they are talking about a wild party. Your response should be why wasnt I invited?",
    "Kerfuffle": "is a fuss or commotion. For example: Whats all the kerfuffle about? Im only two hours late!",
    "Keep your hair on": "can you lose your hair if you get too angry or excited? Thats what this idiom suggests. For example: Keep your hair on  I only accidentally deleted your dissertation.",
    "Kip": "means sleep",
    "Last order": "you will hear bar staff, in pubs, shout this and ring a bell at 11pm or at 10.30pm on Sunday to let customers know they have 20 minutes in which to finish their drinks.",
    "Lurgy": "if someone has the lurgy stay away. It means they are ill and possibly contagious.",
    "Let down": "can be used in a multitude of ways and means you thought the experience was not good. For example: That film was such a let down",
    "Lairy": "used to describe a loud/brash person. For example: Tom gets a bit lairy after a few drinks.",
    "Leave it out": "means you want someone to stop doing or saying something that you find upsetting or annoying.",
    "Minted": "if someone is described as minted it means they are rich, so become their best friend immediately!",
    "Mitts": "a mitten is a kind of glove. But Brits have shortened the word and made it slang for hands. For example: Id love to get my mitts on a new camera!",
    "Mind your Ps and Qs": "means to be on your best behaviour. For example: My parents are very conservative  mind your ps and qs.",
    "Miffed": "is another way of saying you are confused or annoyed. For example: She is really miffed that shes not been invited to the party.",
    "Not my cup of tea": "is a saying used when something is not to your liking. For example: My boyfriend loves football but its not my cup of tea.",
    "Numpty": "if someone does or says something inappropriate, wrong or a bit silly you might hear a Brit saying You numpty youve got your T-shirt on back to front.",
    "Naff": "is used to describe something that is of poor or inferior taste. Example: I dont like my flat, the furniture is a bit naff.",
    "Nosh": "is slang for food. For example: Shall we get some nosh before our lecture?",
    "Old chestnut": "if you tell the same joke or story too many times your bored friends may say oh no not that old chestnut again  in a sarcastic voice.",
    "On the lash": "means to drink excessive amounts of alcohol and you may hear Brits saying, Are you out on the lash tonight?",
    "Oh my giddy aunt": "is another expression for Oh my God! and used to show shock or surprise.",
    "One off": "an expression used to describe something unique. For example: I bought this one-off dress from a student studying fashion.",
    "Odds and sods": "another way of saying bits and pieces. For example: My glasses were in the drawer with all the odds and sods.",
    "Piece of cake": "to describe something as a piece of cake means you think its easy to do. For example, you might say this essay is a piece of cake.",
    "Pip pip": "an old-fashioned way of saying goodbye.",
    "Plonk": "is used to describe wine and the reference is that it isnt the best quality wine.",
    "Porkies": "if you are accused of telling a porkie its serious. It means someone thinks you are lying. The saying comes from an old Cockney rhyme that used pork pies and substituted pies, for lies and it later got shortened to porkies.",
    "Put a sock in it": "If you have had enough of someone talking you can tell them to put a sock in it. It is totally fine to use amongst friends but even you think your lecturer is going on a bit we advise you keep the thought to yourself!",
    "Quid": "is slang for one-pound sterling.",
    "Queenie": "affectionate term Brits use to refer to Queen Elizabeth II (the current Queen)",
    "Quasimodo": "is Cockney rhyming slang for soda water.",
    "Quack": "is slang for a doctor that is suspected of not have the correct qualifications",
    "Queen mum": "is Cockney rhyming slang for the backside (bum).",
    "Queen of the south": "is Cockney rhyming slang for mouth.",
    "Reem": "is English slang for something being nice, good or cool and originates from Essex. In fact, to learn how to speak like someone froEssex you should watch The Only Way Is Essex.",
    "Rank": "is slang for something that is horrible, in bad taste or actually smells unpleasant.",
    "Rinsed": "can be used in a couple of ways. The first is if you defeat someone in an argument, fight or other competition. The second context is when someone pays over the odds for something.",
    "Rosie lee": "is cockney rhyming slang for a cup of tea.",
    "See a man about a dog": "is what you say when you jokingly dont want to reveal where you are going, such as going to the toilet.",
    "Stop faffing around": "If you hear this and its aimed at you. Finish off whatever you are doing fast! The implication is you are taking too long or you are not doing it efficiently.",
    "Skive": "If you dont want to go to that 9 am lecture (understandable) or rather spend the afternoon in the students union then suggest skiving off to a couple of like-minded people, but be prepared to be labelled a skiver by your more studious class fellows.",
    "Shirty": "is one way to describe someone who is ill-tempered.",
    "Stitched up": "is when someone has taken advantage of you. For example, when a classmate nominates you to lead a presentation you can certainly claim to have been stitched up.",
    "Shagged": "This can mean a number of things some ruder than others. But the most common use is when someone is expressing how tired they are.",
    "Taking the piss": "If you hear this being used it means one person is shocked at what another person is doing or saying.",
    "Throw a spanner in the works": "you are likely to hear this saying when something goes wrong or someone makes a mistake.",
    "Tickety-boo": "means OK and may have originated from a Hindi word meaning everything is fine. Its one of those nice-sounding words you will hear when someone wants to express everything is going exceptionally well.",
    "The offie": "The off-licence is the equivalent to an American convenience store, licenced to sell alcohol.",
    "Trundle": "means to move slowly and clumsily.",
    "Umpteen": "means a relatively large, but unspecified amount, of something and is generally used when someone is annoyed. For example, you may hear a Brit saying For the umpteenth time, I said no I will not take the dog for a walk!",
    "Up for it": "slang for being enthusiastic/willing to participate. For example: I like bowling, Im up for it tonight.",
    "Uncle ned": "British slang for bed",
    "Up the spout": "when you have wasted something such as money. For example, Everything I earned over the summer has gone up the spout trying to keep this flat warm.",
    "Under the cosh": "is used when you feel under pressures or restricted. For example: She is under the cosh to deliver that project on time.",
    "From the valleys": "an expression used to describe people from Wales, owing to the number of valleys (which is the low area between hills) in Wales.",
    "V.A.T": "is slang for vodka and tonic.",
    "Veg-out": "is slang for relaxing. As a student, youll want to veg-out every time an essay has been submitted. To veg-out properly you have to order pizza and find a really naff movie to watch in your jim-jams.",
    "Vibe": "is slang for feelings, atmosphere, mood. For example, you may go to a club and say I like the vibe in here the music is reem.",
    "Vino": "is English slang for cheap wine.",
    "Watering hole": "this is one of the many British slang words for a pub",
    "Wonky": "is another word for shaky or unstable. You can use it to refer to a person or an object. For example, you might say a chair has a wonky leg.",
    "Wangle": "means to get or do something that is a bit devious. For example: I wangled an extension on my essay by telling the lecturer my cat died.",
    "Wee": "is a Scottish word for small. In England its a euphemism for urine. Confused? Dont be. If a Scottish person says they want a wee drink they want a whiskey. If an English person says they want a wee direct them to the nearest toilet!",
    "Wind-up": "If you wind someone up it means you are teasing or taunting them.",
    "Well in it": "an expression used when someone is in trouble",
    "X-ray eyes": "you might use the expression have you got x-ray eyes to question what a friend is telling you. For example, How do you know Yinbo ate the rest of the pizza  do you have x ray eyes?",
    "Xtra": "is used to describe something that is very good. You may hear that double chocolate chip ice cream is xtra!",
    "Your round": "if you go to a pub with a group of friends it is most likely that one person will buy the whole group a drink. This will continue until everyone in the group has bought a drink. If it is your turn someone may say It is your round.",
    "Youre a keeper": "used affectionately to describe someone who is nice or someone who has a good attribute. For example, you might hear You can cook  youre such a keeper.",
    "You what": "mostly Brits use this when they havent heard or understood what was said. On some ocasions it might be used when someone disagrees with you. Youll know which one it is by their tone and body language.",
    "Yakking": "used to describe someone who talks too much about things that arent of interest to you. Example: My lecturer wouldnt stop yakking on and on today.",
    "Yonks": "when you havent seen someone for a long time. Example: God, I havent been to a lecture for yonks!",
    "Yank my chain": "if you tease someone about something they are sensitive about they could say to you stop yanking my chain to tell you to stop it.",
    "Zonked": "is used when someone is sleeping or by someone who is expressing they are super tired.",
    "Zebra crossing": "is often used to describe the black and white horizontal markings on the road where pedestrians can cross.",
    "Catch a few Zzzzzzzzzz": "is used when you want to go to sleep."
}